using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp2 {
    //{1. Заполнить массив из восьми элементов следующими значениями: первый элемент массива равен 37, 
    //второй — 0, третий — 50, четвертый — 46, пятый — 34, шестой — 46, седьмой — 0, восьмой —13. Вывести на экран.
    //2. Массив предназначен для хранения значений ростов двенадцати человек.С помощью случайных чисел заполнить массив целыми значениями,
    //лежащими в диапазоне от 163 до 190 включительно.
//3. Присвоить начальные целые значения 1, 2, 3,… ,10 элементам массива из десяти элементов и выводит на экран элементы массива с четным индексом.
//4. Создать массив размерностью в 10 элементов, вывести на экран все элементы массива в обратном порядке.
//5. Создать массив размерностью в 12 элементов, суммировать значения. Суммирование осуществляется в теле цикла for. Значения, используемые в качестве начальных для массива A, вводятся в программу пользователем с клавиатуры.
//6. В массиве хранится информация о сопротивлении каждого из 20 элементов электрической цепи.Все элементы соединены параллельно. Определить общее сопротивление цепи. (1 / R(1) + 1 / R(2)… 1 / R(n))
//7. Выяснить, верно ли, что сумма элементов массива есть неотрицательное число.
//8. Дан массив. Поменять местами: а) второй и пятый элементы; б) m-й и n-й элементы;

    class Program
    {
        static void Main(string[] args)
        {
       

        }
        
    }
}
